getMaterialAreaInFace(Face!System.Runtime.CompilerServices.IsConst*,ElementId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,ElementId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Utility to calculate the area covered with 'materialId' in the face or its face regions
'materialId' should be a valid element ID.
If 'defaultMaterialId' is a valid elementId then areas that have no material ID will be included